// Найти расстояние между точками в пространстве 2D/3D
int X = 89, Y = 43;
Console.WriteLine(X - Y); //2D 





// Показать таблицу квадратов чисел от 1 до N

Console.WriteLine("enter: ");
int hello = int.Parse(Console.ReadLine());
hello = hello + 1;
for (int i = 1; i < hello; i++)
{
    int  a = i * i;
    Console.WriteLine(a);
}


